<script setup lang="ts">

</script>

<template>
    <div>
        <h1 class="text-4xl text-center font-semibold title">AssunaYuuki</h1>

        <div class="mt-5 text-2xl text-block">
            <img src="/img/fennec.png"
                 class="h-full object-cover md:h-64 float-start mb-5 md:me-5 md:mb-2"/>

            <p>
                {{ $t("hello_1") }}
            </p>

            <p class="mt-5">
                Лисы умеют много чего, но каждая лиса не похожа на таких же других. Мы можем отличаться
                окрасом, глазами, ушами и даже хвостом! Вот у меня длинный и пушистый. Я его очень люблю
                и ухаживаю за ним каждый день. Правда-правда.
            </p>

            <p class="mt-5">
                За эти долгие годы я повидала много всего и самым интересным для меня оказались всякие
                технические устройства, которые были изобретены давно давно. Люди такие умные, они могут
                делать очень хорошие устройства, которые живут до сих пор.
            </p>

            <p class="mt-5">
                А ещё я побывала в разных местах. Больше всего мне понравилась Япония. Она такая красивая
                и романтичная. Я нашла там много чего интересного, в том числе японские автомобили. Новые
                мне не очень нравятся, а вот старые просто изумительны!
            </p>

            <p class="mt-5">
                Но вы не подумайте, что я какая-то старуха! Нет-нет! Я освоила эти ваши компьютеры и теперь
                могу много чего на них делать. Мне нравится гулять по виртуальным мирам и создавать их
                собственными руками. Вот такая я умница. Фыр-фыр.
            </p>
        </div>
    </div>
</template>

<style scoped>
.title {
    font-family: 'Amaranth', serif;
}

.text-block {
    font-family: 'Caveat', sans-serif;
}
</style>